MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_dmac.c
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_IRQ_SEL(enIrqSel));

    switch (enIrqSel)
    {
    case TrnErrIrq:
        u32IntStat = (pstcDmaReg->INTSTAT0 & (1ul << (u8Ch + DMA_INTSTAT0_TRNERR_Pos)));
        break;
    case TrnReqErrIrq:
        u32IntStat = (pstcDmaReg->INTSTAT0 & (1ul << (u8Ch + DMA_INTSTAT0_REQERR_Pos)));
        break;
    case TrnCpltIrq:
        u32IntStat = (pstcDmaReg->INTSTAT1 & (1ul << (u8Ch + DMA_INTSTAT1_TC_Pos)));
        break;
    case BlkTrnCpltIrq:
        u32IntStat = (pstcDmaReg->INTSTAT1 & (1ul << (u8Ch + DMA_INTSTAT1_BTC_Pos)));
        break;
    default:
        break;
    }

    return (u32IntStat ? Set : Reset);
}

/**
 *******************************************************************************
 ** \brief  Clear the specified dma interrupt.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 register
 ** \arg    M4_DMA2                     DMAC unit 2 register
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] enIrqSel               The specified dma flag.
 ** \arg    TrnErrIrq                   The DMA transfer error interrupt.
 ** \arg    TrnReqErrIrq                DMA transfer req over error interrupt.
 ** \arg    TrnCpltIrq                  DMA transfer completion interrupt.
 ** \arg    BlkTrnCpltIrq               DMA block completion interrupt.
 **
 ** \retval Ok                          Clear flag successfully.
 ** \retval ErrorInvalidParameter       u8Ch or enIrqSel is invalid.
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_ClearIrqFlag(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch, en_dma_irq_sel_t enIrqSel)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_IRQ_SEL(enIrqSel));

    if (!IS_VALID_CH(u8Ch))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        switch (enIrqSel)
        {
        case TrnErrIrq:
            pstcDmaReg->INTCLR0 |= (1ul << (u8Ch + DMA_INTCLR0_CLRTRNERR_Pos));
            break;
        case TrnReqErrIrq:
            pstcDmaReg->INTCLR0 |= (1ul << (u8Ch + DMA_INTCLR0_CLRREQERR_Pos));
            break;
        case TrnCpltIrq:
            pstcDmaReg->INTCLR1 |= (1ul << (u8Ch + DMA_INTCLR1_CLRTC_Pos));
            break;
        case BlkTrnCpltIrq:
            pstcDmaReg->INTCLR1 |= (1ul << (u8Ch + DMA_INTCLR1_CLRBTC_Pos));
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Enable or disable the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 register
 ** \arg    M4_DMA2                     DMAC unit 2 register
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] enNewState             The new state of dma
 ** \arg    Enable                      Enable dma.
 ** \arg    Disable                     Disable dma.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_ChannelCmd(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch, en_functional_state_t enNewState)
{
    uint16_t u16Timeout = 0u;
    uint32_t u32Temp = 0u;
    uint32_t u32Cnt;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DMA_IDLE == DmaChEnState)
    {
        DmaChEnState = DMA_BUSY;

        /* Read back channel enable register except current channel */
        u32Temp = (pstcDmaReg->CHEN & (~(1ul << u8Ch)));
        if (0ul != u32Temp)
        {
            if (((pstcDmaReg->CHEN & 0x01ul) == 0x01ul) && (u8Ch != DmaCh0))
            {
                u32Cnt = pstcDmaReg->DTCTL0_f.CNT;
                if (pstcDmaReg->MONDTCTL0_f.CNT > DMA_CNT)
                {
                    /* not wait. */
                }
                else if (pstcDmaReg->MONDTCTL0_f.CNT < u32Cnt)
                {
                    while (Reset != (pstcDmaReg->CHEN & 0x01ul))
                    {
                        u16Timeout++;
                        if (u16Timeout > DMATIMEOUT1)
                        {
                            DmaChEnState = DMA_IDLE;
                            return ErrorTimeout;
                        }
                    }
                }
            }
            if (((pstcDmaReg->CHEN & 0x02ul) == 0x02ul) && (u8Ch != DmaCh1))
            {
                u32Cnt = pstcDmaReg->DTCTL1_f.CNT;
                if (pstcDmaReg->MONDTCTL1_f.CNT > DMA_CNT)
                {
                    /* not wait. */
                }
                else if (pstcDmaReg->MONDTCTL1_f.CNT < u32Cnt)
                {
                    u16Timeout = 0u;
                    while (Reset != (pstcDmaReg->CHEN & 0x02ul))
                    {
                        u16Timeout++;
                        if (u16Timeout > DMATIMEOUT1)
                        {
                            DmaChEnState = DMA_IDLE;
                            return ErrorTimeout;
                        }
                    }
                }
            }
            if (((pstcDmaReg->CHEN & 0x04ul) == 0x04ul) && (u8Ch != DmaCh2))
            {
                u16Timeout = 0u;
                u32Cnt = pstcDmaReg->DTCTL2_f.CNT;
                if (pstcDmaReg->MONDTCTL2_f.CNT > DMA_CNT)
                {
                    /* not wait. */
                }
                else if (pstcDmaReg->MONDTCTL2_f.CNT < u32Cnt)
                {
                    while (Reset != (pstcDmaReg->CHEN & 0x04ul))
                    {
                        u16Timeout++;
                        if (u16Timeout > DMATIMEOUT1)
                        {
                            DmaChEnState = DMA_IDLE;
                            return ErrorTimeout;
                        }
                    }
                }
            }
            if (((pstcDmaReg->CHEN & 0x08ul) == 0x08ul) && (u8Ch != DmaCh3))
            {
                u16Timeout = 0u;
                u32Cnt = pstcDmaReg->DTCTL3_f.CNT;
                if (pstcDmaReg->MONDTCTL3_f.CNT > DMA_CNT)
                {
                    /* not wait. */
                }
                else if (pstcDmaReg->MONDTCTL3_f.CNT < u32Cnt)
                {
                    while (Reset != (pstcDmaReg->CHEN & 0x08ul))
                    {
                        u16Timeout++;
                        if (u16Timeout > DMATIMEOUT1)
                        {
                            DmaChEnState = DMA_IDLE;
                            return ErrorTimeout;
                        }
                    }
                }
            }
        }

        switch (enNewState)
        {
        case Enable:
            pstcDmaReg->CHEN |= (1ul << (u8Ch + DMA_CHEN_CHEN_Pos)) & 0x0fu;
            break;
        case Disable:
            pstcDmaReg->CHEN &= (~(1ul << (u8Ch + DMA_CHEN_CHEN_Pos))) & 0x0fu;
            break;
        }

        DmaChEnState = DMA_IDLE;
        return Ok;
    }

