MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_dmac.c
    return Error;
}

/**
 *******************************************************************************
 ** \brief  DMA Re_Config control configuration.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 register
 ** \arg    M4_DMA2                     DMAC unit 2 register
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] pstcDmaReCfg           The configuration struct of DMA.
 ** \arg    u16SrcRptBSize              The source repeat size.
 ** \arg    u16SrcRptBSize;             The source repeat size.
 ** \arg    u16DesRptBSize;             The destination repeat size.
 ** \arg    enReCfgLlp;                 Enable llp re_config function or not.
 ** \arg    enReCfgCh;                  DMA re_config channel.
 ** \arg    enSaddrMd;                  DMA re_config source address mode.
 ** \arg    enDaddrMd;                  DMA re_config destination address mode.
 ** \arg    enCntMd;                    DMA re_config count mode.
 ** \arg    stcSrcNseqBCfg;             The source no_sequence re_config.
 ** \arg    stcDesNseqBCfg;             The destination no_sequence re_config.
 **
 ** \retval None
 **
 ** \note   This function should be used while DMA disable.
 **
 ******************************************************************************/
void DMA_InitReConfig(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch,
                      const stc_dma_recfg_ctl_t *pstcDmaReCfg)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_CNT_MODE(pstcDmaReCfg->enCntMd));
    DDL_ASSERT(IS_VALID_DADDR_MODE(pstcDmaReCfg->enDaddrMd));
    DDL_ASSERT(IS_VALID_SADDR_MODE(pstcDmaReCfg->enSaddrMd));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcDmaReCfg->enReCfgLlp));

    pstcDmaReg->RCFGCTL_f.RCFGLLP = pstcDmaReCfg->enReCfgLlp;
    pstcDmaReg->RCFGCTL_f.SARMD = pstcDmaReCfg->enSaddrMd;
    pstcDmaReg->RCFGCTL_f.DARMD = pstcDmaReCfg->enDaddrMd;
    pstcDmaReg->RCFGCTL_f.CNTMD = pstcDmaReCfg->enCntMd;

    /* Set DMA source repeat size B. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->RPTB0, u8Ch, DMA_RPT_SRPT, (uint32_t)pstcDmaReCfg->u16SrcRptBSize);
    /* Set DMA destination repeat size B. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->RPTB0, u8Ch, DMA_RPT_DRPT, (uint32_t)pstcDmaReCfg->u16DesRptBSize);
    /* Set DMA source no_sequence B. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch, DMA_SNSEQCTL_SOFFSET, pstcDmaReCfg->stcSrcNseqBCfg.u32Offset);
    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch, DMA_SNSEQCTL_SNSCNT, (uint32_t)pstcDmaReCfg->stcSrcNseqBCfg.u16Cnt);
    /* Set DMA destination no_sequence B. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch, DMA_DNSEQCTL_DOFFSET, pstcDmaReCfg->stcDesNseqBCfg.u32Offset);
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch, DMA_DNSEQCTL_DNSCNT, (uint32_t)pstcDmaReCfg->stcDesNseqBCfg.u16Cnt);
}

/**
 *******************************************************************************
 ** \brief  Disable or enable DMA Re_Config.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 register
 ** \arg    M4_DMA2                     DMAC unit 2 register
 **
 ** \param  [in] enNewState             The new state of dma
 ** \arg    Enable                      Enable dma.
 ** \arg    Disable                     Disable dma.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void DMA_ReCfgCmd(M4_DMA_TypeDef *pstcDmaReg, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    pstcDmaReg->RCFGCTL_f.RCFGEN = enNewState;
}

/**
 *******************************************************************************
 ** \brief  Get the specified dma flag status.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 register
 ** \arg    M4_DMA2                     DMAC unit 2 register
 **
 ** \param  [in] enDmaChFlag            The specified dma flag.
 ** \arg    DmaSta                      The DMA status.
 ** \arg    ReCfgSta                    The DMA re_config stauts.
 ** \arg    DmaCh0Sta                   The DMA channel 0 status.
 ** \arg    DmaCh1Sta                   The DMA channel 1 status.
 ** \arg    DmaCh2Sta                   The DMA channel 2 status.
 ** \arg    DmaCh3Sta                   The DMA channel 3 status.
 **
 ** \retval the specified dma flag status
 **
 ** \note   None
 **
 ******************************************************************************/
en_flag_status_t DMA_GetChFlag(M4_DMA_TypeDef *pstcDmaReg, en_dma_ch_flag_t enDmaChFlag)
{
    uint32_t u32IntStat = 0ul;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_DMA_STA(enDmaChFlag));

    switch (enDmaChFlag)
    {
    case DmaSta:
        u32IntStat = pstcDmaReg->CHSTAT_f.DMAACT;
        break;
    case ReCfgSta:
        u32IntStat = pstcDmaReg->CHSTAT_f.RCFGACT;
        break;
    case DmaCh0Sta:
        u32IntStat = (pstcDmaReg->CHSTAT_f.CHACT & DMACH0);
        break;
    case DmaCh1Sta:
        u32IntStat = (pstcDmaReg->CHSTAT_f.CHACT & DMACH1);
        break;
    case DmaCh2Sta:
        u32IntStat = (pstcDmaReg->CHSTAT_f.CHACT & DMACH2);
        break;
    case DmaCh3Sta:
        u32IntStat = (pstcDmaReg->CHSTAT_f.CHACT & DMACH3);
        break;
    default:
        break;
    }
    return (u32IntStat ? Set : Reset);
}

/**
 *******************************************************************************
 ** \brief  Set the source address of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2                     DMAC unit 2 registers
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] u32Address             The source address.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetSrcAddress(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch, uint32_t u32Address)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

