MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_dmac.c
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_SNSDIST(pstcSrcNseqBCfg->u32NseqDist));
    DDL_ASSERT(IS_VALID_SNSCNTB(pstcSrcNseqBCfg->u16CntB));

    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch, DMA_SNSEQCTLB_SNSDIST, pstcSrcNseqBCfg->u32NseqDist);
    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch, DMA_SNSEQCTLB_SNSCNTB, (uint32_t)pstcSrcNseqBCfg->u16CntB);

    /* Ensure the no-sequence offset & count has been writed */
    while ((pstcSrcNseqBCfg->u32NseqDist | ((uint32_t)pstcSrcNseqBCfg->u16CntB << DMA_SNSEQCTLB_SNSCNTB_Pos)) != READ_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch))
    {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch,
                              DMA_SNSEQCTLB_SNSDIST, pstcSrcNseqBCfg->u32NseqDist);
            MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch,
                              DMA_SNSEQCTLB_SNSCNTB, (uint32_t)pstcSrcNseqBCfg->u16CntB);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set the destination no-sequence offset & count of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] pstcDesNseqCfg
 ** \arg    u32offset                   The destination no-sequence offset.
 ** \arg    u16cnt                      The destination no-sequence count.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetDesNseqCfg(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch,
                              const stc_dma_nseq_cfg_t *pstcDesNseqCfg)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_DNSOFFSET(pstcDesNseqCfg->u32Offset));
    DDL_ASSERT(IS_VALID_DNSCNT(pstcDesNseqCfg->u16Cnt));

    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DOFFSET, pstcDesNseqCfg->u32Offset);
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DNSCNT, (uint32_t)pstcDesNseqCfg->u16Cnt);

    /* Ensure the no-sequence offset & count has been writed */
    while ((pstcDesNseqCfg->u32Offset | ((uint32_t)pstcDesNseqCfg->u16Cnt << DMA_DNSEQCTL_DNSCNT_Pos)) != READ_DMA_CH_REG(&pstcDmaReg->MONDNSEQCTL0, u8Ch))
    {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch,
                              DMA_DNSEQCTL_DOFFSET, pstcDesNseqCfg->u32Offset);
            MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch,
                              DMA_DNSEQCTL_DNSCNT, (uint32_t)pstcDesNseqCfg->u16Cnt);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set the destination no-sequence offset & count of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] pstcDesNseqBCfg
 ** \arg    u32offset                   The destination no-sequence offset.
 ** \arg    u16cnt                      The destination no-sequence count.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetDesNseqBCfg(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch,
                               const stc_dma_nseqb_cfg_t *pstcDesNseqBCfg)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_DNSDIST(pstcDesNseqBCfg->u32NseqDist));
    DDL_ASSERT(IS_VALID_DNSCNTB(pstcDesNseqBCfg->u16CntB));

    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch, DMA_DNSEQCTLB_DNSDIST, pstcDesNseqBCfg->u32NseqDist);
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch, DMA_DNSEQCTLB_DNSCNTB, (uint32_t)pstcDesNseqBCfg->u16CntB);

    /* Ensure the no-sequence offset & count has been writed */
    while ((pstcDesNseqBCfg->u32NseqDist | ((uint32_t)pstcDesNseqBCfg->u16CntB << DMA_DNSEQCTLB_DNSCNTB_Pos)) != READ_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch))
    {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch,
                              DMA_DNSEQCTLB_DNSDIST, pstcDesNseqBCfg->u32NseqDist);
            MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch,
                              DMA_DNSEQCTLB_DNSCNTB, (uint32_t)pstcDesNseqBCfg->u16CntB);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set linked list pointer of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] u32Pointer             The decriptor pointer.
 **
 ** \retval None.
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetLLP(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch, uint32_t u32Pointer)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_LLP(u32Pointer));

    WRITE_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch, u32Pointer);

    /* Ensure the destination repeat size has been writed */
    while (u32Pointer != ((READ_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch) & DMA_LLP_LLP) >> DMA_LLP_LLP_Pos))
    {
        u16Timeout++;
        if (u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            WRITE_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch, u32Pointer);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set The DMA trigger source.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] enSrc                  The DMA trigger source.
 **
 ** \retval None.
 **
 ** \note   Before call this function, shoud ensure enable AOS.
 **
 ******************************************************************************/
void DMA_SetTriggerSrc(const M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch, en_event_src_t enSrc)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));

    if (M4_DMA1 == pstcDmaReg)
    {
        WRITE_DMA_CH_TRGSEL(&M4_AOS->DMA1_TRGSEL0, u8Ch, enSrc);
    }
    else if (M4_DMA2 == pstcDmaReg)
    {
        WRITE_DMA_CH_TRGSEL(&M4_AOS->DMA2_TRGSEL0, u8Ch, enSrc);
    }
    else
    {
        // else
    }
}

/**
 *******************************************************************************
 ** \brief  Set linked list pointer of the specified dma channel.
 **
 ** \param  [in] enSrc                  The DMA trigger source.
 **
 ** \retval None.
 **
 ** \note   Before call this function, should ensure enable AOS.
 **
 ******************************************************************************/
void DMA_SetReConfigTriggerSrc(en_event_src_t enSrc)
{

    M4_AOS->DMATRGSELRC_f.TRGSEL = enSrc;
}
/**
 *******************************************************************************
 ** \brief  The configuration of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] pstcChCfg              The configuration pointer.
 ** \arg    enSrcInc                    The source address mode.
 ** \arg    enDesInc                    The destination address mode.
 ** \arg    enSrcRptEn                  The source repeat function(enable or disable).
 ** \arg    enDesRptEn                  The destination repeat function(enable or disable).
 ** \arg    enSrcNseqEn                 The source no_sequence function(enable or disable).
 ** \arg    enDesNseqEn                 The destination no_sequence function(enable or disable).
 ** \arg    enTrnWidth                  The transfer data width.
 ** \arg    enLlpEn                     The linked list pointer function(enable or disable).
 ** \arg    enLlpMd                     The linked list pointer mode.
 ** \arg    enIntEn                     The interrupt function(enable or disable).
 **
 ** \retval None.
 **
 ** \note   None
 **
 ******************************************************************************/
void DMA_ChannelCfg(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch,
                    const stc_dma_ch_cfg_t *pstcChCfg)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_ADDR_MODE(pstcChCfg->enSrcInc));
    DDL_ASSERT(IS_VALID_ADDR_MODE(pstcChCfg->enDesInc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enSrcRptEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enDesRptEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enSrcNseqEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enDesNseqEn));
    DDL_ASSERT(IS_VALID_TRN_WIDTH(pstcChCfg->enTrnWidth));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enLlpEn));
    DDL_ASSERT(IS_VALID_LLP_MODE(pstcChCfg->enLlpMd));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enIntEn));

    /* Set the source address mode. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_SINC, pstcChCfg->enSrcInc);
    /* Set the destination address mode. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_DINC, pstcChCfg->enDesInc);
    /* Enable or disable source repeat function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_SRPTEN, pstcChCfg->enSrcRptEn);
    /* Enable or disable destination repeat function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_DRPTEN, pstcChCfg->enDesRptEn);
    /* Enable or disable source no_sequence function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_SNSEQEN, pstcChCfg->enSrcNseqEn);
    /* Enable or disable destination no_sequence function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_DNSEQEN, pstcChCfg->enDesNseqEn);
    /* Set the transfer data width. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_HSIZE, pstcChCfg->enTrnWidth);
    /* Enable or disable linked list pointer no_sequence function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_LLPEN, pstcChCfg->enLlpEn);
    /* Set the linked list pointer mode. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_LLPRUN, pstcChCfg->enLlpMd);
    /* Enable or disable channel interrupt function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_IE, pstcChCfg->enIntEn);
}

/**
 *******************************************************************************
 ** \brief  The configuration of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] pstcDmaCfg             The configuration pointer.
 ** \arg    enSrcInc                    The source address mode.
 ** \arg    enDesInc                    The destination address mode.
 ** \arg    enSrcRptEn                  The source repeat function(enable or disable).
 ** \arg    enDesRptEn                  The destination repeat function(enable or disable).
 ** \arg    enSrcNseqEn                 The source no_sequence function(enable or disable).
 ** \arg    enDesNseqEn                 The destination no_sequence function(enable or disable).
 ** \arg    enTrnWidth                  The transfer data width.
 ** \arg    enLlpEn                     The linked list pointer function(enable or disable).
 ** \arg    enLlpMd                     The linked list pointer mode.
 ** \arg    enIntEn                     The interrupt function(enable or disable).
 **
 ** \retval None.
 **
 ** \note   This function should be used after enable DMAx clk(PWC_Fcg0PeriphClockCmd)
 **         and before channel enable.
 **
 ******************************************************************************/
void DMA_InitChannel(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch,
                     const stc_dma_config_t *pstcDmaCfg)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_BLKSIZE(pstcDmaCfg->u16BlockSize));
    DDL_ASSERT(IS_VALID_TRNCNT(pstcDmaCfg->u16TransferCnt));
    DDL_ASSERT(IS_VALID_SRPT_SIZE(pstcDmaCfg->u16SrcRptSize));
    DDL_ASSERT(IS_VALID_DRPT_SIZE(pstcDmaCfg->u16DesRptSize));

    /* Enable DMA. */
    DMA_Cmd(pstcDmaReg, Enable);
    /* Disable DMA interrupt */
    CLR_DMA_CH_REG_BIT(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_IE_Pos);
    /* Set DMA source address. */
    WRITE_DMA_CH_REG(&pstcDmaReg->SAR0, u8Ch, pstcDmaCfg->u32SrcAddr);
    /* Set DMA destination address. */
    WRITE_DMA_CH_REG(&pstcDmaReg->DAR0, u8Ch, pstcDmaCfg->u32DesAddr);
    /* Set DMA transfer block size. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_BLKSIZE, (uint32_t)pstcDmaCfg->u16BlockSize);
    /* Set DMA transfer count. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_CNT, (uint32_t)pstcDmaCfg->u16TransferCnt);
    /* Set DMA source repeat size. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->RPT0, u8Ch, DMA_RPT_SRPT, (uint32_t)pstcDmaCfg->u16SrcRptSize);
    /* Set DMA destination repeat size. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->RPT0, u8Ch, DMA_RPT_DRPT, (uint32_t)pstcDmaCfg->u16DesRptSize);
    /* Set DMA source no_sequence. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTL0, u8Ch, DMA_SNSEQCTL_SOFFSET, pstcDmaCfg->stcSrcNseqCfg.u32Offset);
    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTL0, u8Ch, DMA_SNSEQCTL_SNSCNT, (uint32_t)pstcDmaCfg->stcSrcNseqCfg.u16Cnt);
    /* Set DMA destination no_sequence. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DOFFSET, pstcDmaCfg->stcDesNseqCfg.u32Offset);
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DNSCNT, (uint32_t)pstcDmaCfg->stcDesNseqCfg.u16Cnt);
    /* Set DMA linked list pointer. */
    WRITE_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch, pstcDmaCfg->u32DmaLlp);
    /* Set DMA channel parameter. */
    DMA_ChannelCfg(pstcDmaReg, u8Ch, &pstcDmaCfg->stcDmaChCfg);
}

void DMA_DeInit(M4_DMA_TypeDef *pstcDmaReg, uint8_t u8Ch)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));

    /* reset dma channel */
    WRITE_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->DAR0, u8Ch, DMA_DAR_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->SAR0, u8Ch, DMA_SAR_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->SNSEQCTL0, u8Ch, DMA_SNSEQCTL_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->RPT0, u8Ch, DMA_RPT_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch, DMA_LLP_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->RCFGCTL, u8Ch, DMA_RCFGCTL_DEFAULT);

    /* Set trigger source event max */
    DMA_SetTriggerSrc(pstcDmaReg, u8Ch, EVT_MAX);
    /* disable channel */
    DMA_ChannelCmd(pstcDmaReg, u8Ch, Disable);
}

#endif /* DDL_DMAC_ENABLE */

//@} // DmacGroup

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
